######################################################################################################################
###             Скрипт автоматизации резервного копирования удаленных серверов в указанную папку                   ###
###             BackupRemoteServers.ps1 ver 0.0.1
######################################################################################################################


# Параметры 

$backupPath = '\\192.168.1.167\backup\HPV'  # Путь для резервного копирования
[string[]] $arrayOfServersName =    'servavir.oblgaz56.local',
                                    'servavr2.oblgaz56.local'
Write-Host $backupPath

foreach($serverName in $arrayOfServersName) {  # Основной цикл обработки массива серверов
    Write-Host $serverName
}


